apache bench/output.txt
🔐 Logging in to get JWT token...
✅ Got Token: eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJhc2RhQGdtYWlsLmNvbSIsImlhdCI6MTc0NDkxMDU2NCwiZXhwIjoxNzQ0OTk2OTY0fQ.TBb8s0QUj9U-vwyxkUYQag3A4AR1RYwR155OS4Lzf6g

🧪 Testing GET /user
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/user/6800c8cb94e9a76808f545ca
Document Length:        471 bytes

Concurrency Level:      10
Time taken for tests:   1.169 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      74600 bytes
HTML transferred:       47100 bytes
Requests per second:    85.52 [#/sec] (mean)
Time per request:       116.937 [ms] (mean)
Time per request:       11.694 [ms] (mean, across all concurrent requests)
Transfer rate:          62.30 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:    32   45  56.0     35     536
Waiting:       32   44  55.9     35     535
Total:         32   45  56.0     36     537

Percentage of the requests served within a certain time (ms)
  50%     36
  66%     37
  75%     40
  80%     40
  90%     47
  95%     47
  98%    293
  99%    537
 100%    537 (longest request)

➕ Testing POST /habit (create)
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/habit
Document Length:        62 bytes

Concurrency Level:      10
Time taken for tests:   1.166 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      16700 bytes
Total body sent:        34700
HTML transferred:       6200 bytes
Requests per second:    85.77 [#/sec] (mean)
Time per request:       116.590 [ms] (mean)
Time per request:       11.659 [ms] (mean, across all concurrent requests)
Transfer rate:          13.99 [Kbytes/sec] received
                        29.06 kb/s sent
                        43.05 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    36  111 206.8     42     763
Waiting:       36  110 206.8     41     763
Total:         37  111 206.8     42     763

Percentage of the requests served within a certain time (ms)
  50%     42
  66%     44
  75%     46
  80%     47
  90%    719
  95%    728
  98%    728
  99%    763
 100%    763 (longest request)

📂 Testing GET /habit
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/habit
Document Length:        69534 bytes

Concurrency Level:      10
Time taken for tests:   3.890 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      6963900 bytes
HTML transferred:       6953400 bytes
Requests per second:    25.71 [#/sec] (mean)
Time per request:       389.025 [ms] (mean)
Time per request:       38.903 [ms] (mean, across all concurrent requests)
Transfer rate:          1748.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:   146  363 214.7    295    1191
Waiting:      143  363 214.5    294    1188
Total:        147  364 214.7    295    1191

Percentage of the requests served within a certain time (ms)
  50%    295
  66%    385
  75%    417
  80%    437
  90%    769
  95%    826
  98%   1161
  99%   1191
 100%   1191 (longest request)

✅ Testing POST /user/:id/habit
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/user/6800c8cb94e9a76808f545ca/habit
Document Length:        471 bytes

Concurrency Level:      10
Time taken for tests:   0.417 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      74600 bytes
Total body sent:        38500
HTML transferred:       47100 bytes
Requests per second:    239.70 [#/sec] (mean)
Time per request:       41.718 [ms] (mean)
Time per request:       4.172 [ms] (mean, across all concurrent requests)
Transfer rate:          174.63 [Kbytes/sec] received
                        90.12 kb/s sent
                        264.75 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:    33   37   2.8     36      47
Waiting:       33   37   2.8     36      47
Total:         34   37   2.8     36      47

Percentage of the requests served within a certain time (ms)
  50%     36
  66%     38
  75%     40
  80%     40
  90%     43
  95%     43
  98%     44
  99%     47
 100%     47 (longest request)

✅ Testing POST /user/:id/checkHabit
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/user/6800c8cb94e9a76808f545ca/checkHabit
Document Length:        471 bytes

Concurrency Level:      10
Time taken for tests:   2.954 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      74600 bytes
Total body sent:        39000
HTML transferred:       47100 bytes
Requests per second:    33.85 [#/sec] (mean)
Time per request:       295.435 [ms] (mean)
Time per request:       29.544 [ms] (mean, across all concurrent requests)
Transfer rate:          24.66 [Kbytes/sec] received
                        12.89 kb/s sent
                        37.55 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:   106  229 231.6    111     708
Waiting:      106  229 231.6    111     707
Total:        107  230 231.6    111     708

Percentage of the requests served within a certain time (ms)
  50%    111
  66%    114
  75%    117
  80%    632
  90%    701
  95%    704
  98%    706
  99%    708
 100%    708 (longest request)

💪 Testing POST /workouts
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/workouts
Document Length:        138 bytes

Concurrency Level:      10
Time taken for tests:   1.931 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      24300 bytes
Total body sent:        44300
HTML transferred:       13800 bytes
Requests per second:    51.80 [#/sec] (mean)
Time per request:       193.063 [ms] (mean)
Time per request:       19.306 [ms] (mean, across all concurrent requests)
Transfer rate:          12.29 [Kbytes/sec] received
                        22.41 kb/s sent
                        34.70 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:    55  184 246.6     66     827
Waiting:       55  184 246.5     66     826
Total:         55  185 246.6     67     827

Percentage of the requests served within a certain time (ms)
  50%     67
  66%     71
  75%     77
  80%    497
  90%    753
  95%    825
  98%    827
  99%    827
 100%    827 (longest request)

📂 Testing GET /workouts
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/workouts
Document Length:        28080 bytes

Concurrency Level:      10
Time taken for tests:   2.298 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      2818500 bytes
HTML transferred:       2808000 bytes
Requests per second:    43.51 [#/sec] (mean)
Time per request:       229.809 [ms] (mean)
Time per request:       22.981 [ms] (mean, across all concurrent requests)
Transfer rate:          1197.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:   109  207 119.0    175     728
Waiting:      109  206 119.0    175     727
Total:        109  207 119.1    175     728

Percentage of the requests served within a certain time (ms)
  50%    175
  66%    216
  75%    243
  80%    252
  90%    309
  95%    373
  98%    688
  99%    728
 100%    728 (longest request)

✅ Testing POST /user/:id/workout
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/user/6800c8cb94e9a76808f545ca/workout
Document Length:        471 bytes

Concurrency Level:      10
Time taken for tests:   0.820 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      74600 bytes
Total body sent:        41500
HTML transferred:       47100 bytes
Requests per second:    122.00 [#/sec] (mean)
Time per request:       81.970 [ms] (mean)
Time per request:       8.197 [ms] (mean, across all concurrent requests)
Transfer rate:          88.88 [Kbytes/sec] received
                        49.44 kb/s sent
                        138.32 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:    52   73  44.5     58     232
Waiting:       52   72  44.4     58     232
Total:         53   73  44.5     59     233

Percentage of the requests served within a certain time (ms)
  50%     59
  66%     59
  75%     60
  80%     62
  90%    172
  95%    232
  98%    232
  99%    233
 100%    233 (longest request)

✅ Testing POST /user/:id/checkWorkout
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/user/6800c8cb94e9a76808f545ca/checkWorkout
Document Length:        471 bytes

Concurrency Level:      10
Time taken for tests:   2.997 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      74600 bytes
Total body sent:        39400
HTML transferred:       47100 bytes
Requests per second:    33.37 [#/sec] (mean)
Time per request:       299.702 [ms] (mean)
Time per request:       29.970 [ms] (mean, across all concurrent requests)
Transfer rate:          24.31 [Kbytes/sec] received
                        12.84 kb/s sent
                        37.15 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:   109  271 223.2    136     976
Waiting:      109  270 223.1    136     976
Total:        109  271 223.2    136     976

Percentage of the requests served within a certain time (ms)
  50%    136
  66%    174
  75%    461
  80%    521
  90%    687
  95%    733
  98%    743
  99%    976
 100%    976 (longest request)

🎯 Done benchmarking all JWT-secured microservices.